*>Copyright (c) 2016-2020 NTT DATA, Inc. All rights reserved.
*>compiler version:  5.2.27677
*>source file name:  TEST20.cbl
*>date generated  :  Sat Jul 18 06:13:13 EDT 2020
*>compiler options:  -d64 -cv -dcmi -ld -pt2 -cax -dv=0 -ef
*>source encoding :  UTF-8
*>target encoding :  ISO-8859-1
IDENTIFICATION DIVISION.                                         
PROGRAM-ID.    TEST20.                                           
AUTHOR.        CICERO RAUTENBACH.                                
DATE-WRITTEN.  07/11/2020.                                       
                                                                 
ENVIRONMENT DIVISION.                                            
                                                                 
CONFIGURATION SECTION.                                           
                                                                 
SOURCE-COMPUTER. IBM-370.                                        
OBJECT-COMPUTER. IBM-370.                                        
                                                                 
INPUT-OUTPUT SECTION.                                            
                                                                 
FILE-CONTROL.                                                    
                                                                 
    SELECT FILE1 ASSIGN TO FILE1                                 
                 FILE STATUS IS WS-FILE-STATUS.                  
                                                                 
DATA DIVISION.                                                   
                                                                 
FILE SECTION.                                                    
                                                                 
FD  FILE1                                                        
    RECORD IS VARYING IN SIZE                                    
    FROM 10 TO 80 CHARACTERS                                     
    DEPENDING ON WS-RECORD-LENGTH.                               
01  WS-RECORD                             PIC X(80).             
                                                                 
WORKING-STORAGE SECTION.                                         
                                                                 
01 WS-RECORD-LENGTH                       PIC 9999.              
01 WS-FILE-STATUS.                                               
   05 WS-FILE-STATUS-1                    PIC X.                 
   05 WS-FILE-STATUS-2                    PIC X.                 
   05 WS-FILE-STATUS-2B REDEFINES WS-FILE-STATUS-2               
                                          PIC 99 COMP-X.         
01 WS-EOF-IND                             PIC X(30).             
   88 ENDREACHED  VALUE "ENDREACHED".                            
01 WS-DATA                                PIC X(80).             
                                                                 
PROCEDURE DIVISION.                                              
                                                                 
MAIN-PARA.                                                       
     OPEN OUTPUT FILE1.                                          
     PERFORM 1000-WRITE-PARA THRU 1000-EXIT.                     
     CLOSE FILE1.                                                
     STOP RUN.                                                   
                                                                 
 1000-WRITE-PARA.                                                
     MOVE "12345678901234567890123456789012345678901234567890"   
          TO WS-RECORD.                                          
     MOVE 10 to WS-RECORD-LENGTH.                                
     WRITE WS-RECORD.                                            
     MOVE 20 to WS-RECORD-LENGTH.                                
     WRITE WS-RECORD.                                            
     MOVE 30 to WS-RECORD-LENGTH.                                
     WRITE WS-RECORD.                                            
     MOVE 19 to WS-RECORD-LENGTH.                                
     WRITE WS-RECORD.                                            
     IF WS-FILE-STATUS-1 NOT = 0                                 
       DISPLAY ">>>>>>> ERROR <<<<<<<<".                         
     MOVE 40 to WS-RECORD-LENGTH.                                
     WRITE WS-RECORD.                                            
                                                                 
 1000-EXIT.                                                      
     EXIT.                                                       
*> ------------------------------------------------------------------------------------------------------------------
*> The source line number references in the following sections are either of
*> the form <line-number> or <file-number>:<line-number>. The first form is
*> used as an abbreviation for 0:<line-number>.
*> The following is a key allowing the determination of the file name from
*> the <file-number>.
*>  
*>          0: TEST20.cbl
*>  
*> ------------------------------------------------------------------------------------------------------------------
*> DATA MAP KEY
*>               Sec(Section) Fil = File Section                Type Flags: column O    ---> O = Occurs Item
*>                            Wor = Working-Storage Section                 column R    ---> R = Redefines
*>                            Loc = Local-Storage Section                   column X/G  ---> X = External
*>                            Rep = Report Section                                           G = Global
*>                            Lin = Linkage Section                         
*> ------------------------------------------------------------------------------------------------------------------
*> Data map for Program-Id: TEST20
*> ------------------------------------------------------------------------------------------------------------------
*>     Line    Name                                                  Size Offset      Sec Flags Data Type
*>                                                                                        O R X
*>                                                                                            G
*> ------------------------------------------------------------------------------------------------------------------
*>       28 01 WS-RECORD                                               80             Fil       Display
*>       32 01 WS-RECORD-LENGTH                                         4             Wor       Display Numeric
*>       33 01 WS-FILE-STATUS                                           2             Wor       Group
*>       34   05 WS-FILE-STATUS-1                                       1 (000000000)           Display
*>       35   05 WS-FILE-STATUS-2                                       1 (000000001)           Display
*>       36   05 WS-FILE-STATUS-2B                                      1 (000000001)       R   Binary
*>       38 01 WS-EOF-IND                                              30             Wor       Display
*>       39   88 ENDREACHED                                                                     
*>       40 01 WS-DATA                                                 80             Wor       Display
*> ------------------------------------------------------------------------------------------------------------------
*> --I: #14 Compiling TEST20.cbl
